tutorials/modules/fluid/aerofoilNACA0012Steady/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

speed           250;
angleOfAttack   0; // degs

angle           #calc "degToRad($angleOfAttack)";
liftDir         #codeStream
{
    codeInclude #{ #include "vector.H" #};
    code #{ os << vector(-::sin($angle), 0, ::cos($angle)); #};
};

dragDir         #codeStream
{
    codeInclude #{ #include "vector.H" #};
    code #{ os << vector(::cos($angle), 0, ::sin($angle)); #};
};

Uinlet         #codeStream
{
    codeInclude #{ #include "vector.H" #};
    code #{ os << $speed*vector(::cos($angle), 0, ::sin($angle)); #};
};

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $Uinlet;

boundaryField
{
    freestream
    {
        type            freestreamVelocity;
        freestreamValue uniform $Uinlet;
        value           uniform $Uinlet;
    }

    wall
    {
        type            noSlip;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
